# UpdateRenderAppearanceLibrary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..UpdateRenderAppearanceLibrary Method
Application Class See Also
---
Updates the stored render appearance library, giving the Revit session access to any new RPC content.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void UpdateRenderAppearanceLibrary()
```

Visual Basic
---
```text
Public Sub UpdateRenderAppearanceLibrary
```

Visual C++
---
```text
public:
void UpdateRenderAppearanceLibrary()
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace